---
kind: property
id: P:Autodesk.Revit.DB.DividedPath.DisplayNodes
source: html/0dcdd9db-1f28-fa74-c717-80de38ac80fd.htm
---
# Autodesk.Revit.DB.DividedPath.DisplayNodes Property

Controls whether the points of the divided path are visible

## Syntax (C#)
```csharp
public bool DisplayNodes { get; set; }
```

## Remarks
If true the nodes of the divided path are visible.
 If false the nodes are hidden.